Revit 2024 API
Categories.Item Property
 Retrieves a category object matching an identifier.
Overload List
Name | Description
Item[String]
Gets a category which has the specified name from this list of top-level categories.
 (Overrides CategoryNameMap.Item[String].)
Item[BuiltInCategory]
 Retrieves a category object corresponding to a BuiltInCategory id.
See Also
Categories Class
Categories Members
Autodesk.Revit.DB Namespace